srv/Catalogs/ВнешниеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВнешниеОбработки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

srv/Catalogs/ВнешниеОбработки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	
	Если не ЗначениеЗаполнено(Объект.ВидОбработки) Тогда 
		Сообщить("Не выбран тип обработки.");
		Возврат;
	КонецЕсли;	
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Этап","Начало");
	ДополнительныеПараметры.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификатор);
	ДополнительныеПараметры.Вставить("ОбработкаЗавершения", Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));
	ДополнительныеПараметры.Вставить("ОписаниеДиалога", Новый Структура);
	
	ОписаниеДиалогаПоВидуОбработки(Объект.ВидОбработки, ДополнительныеПараметры.ОписаниеДиалога);
	
	ОбщегоНазначенияКлиент.ЗагрузкаФайлаАсинхронно(Неопределено,ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураимениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(Результат.Имя);
	Объект.ИмяФайла = СтруктураимениФайла.Имя;
	
	СохранитьФайлВхранилище(Результат.Хранение);	
	
КонецПроцедуры

&НаСервере
Процедура СохранитьФайлВхранилище(Адрес)
	 
	ДД = ПолучитьИзВременногоХранилища(Адрес);
	Объект.Хранилище = Base64Строка(ДД);
	
КонецПроцедуры	


&НаСервереБезКонтекста
Функция ОписаниеДиалогаПоВидуОбработки(ВидОбработки, ОписаниеДиалога) 
	
	ДопДанные = Справочники.ВнешниеОбработки.ДополнительныеДанныеПоВидуОбработки(ВидОбработки);
	
	ОписаниеДиалога.Вставить("Заголовок", "Выберите файл");
	ОписаниеДиалога.Вставить("ПолноеИмяФайла", "");
	ОписаниеДиалога.Вставить("ПредварительныйПросмотр", Истина);
	ОписаниеДиалога.Вставить("МножественныйВыбор", Ложь);
	ОписаниеДиалога.Вставить("Фильтр", ДопДанные.Фильтр);
	
КонецФункции
